[
    {
        "id": "aart",
        "name": "Assabet River Rail Trail",
        "description": "The Assabet River Rail Trail (ARRT) is a partially-completed multi-use rail trail running through the cities and towns of Marlborough, Hudson, Stow, Maynard, and Acton. It is a conversion of the abandoned Marlborough Branch of the Fitchburg Railroad. The right-of-way parallels the Assabet River in the trail's midsection."
    },
    {
        "id": "alewife_brook",
        "name": "Alewife Greenway Path",
        "description": null
    },
    {
        "id": "alewife_lp",
        "name": "Alewife Linear Park",
        "description": null
    },
    {
        "id": "amesbury",
        "name": "Amesbury Riverwalk Trail",
        "description": "This paved path allows walkers and bikers to travel between the Lower Millyard in downtown Amesbury and Carriagetown Marketplace (Stop & Shop) with only one street crossing. The rail trail is well-maintained and is popular with families, walkers and joggers. The trail parallels the Lower Powow River, which is visible through the trees at certain points."
    },
    {
        "id": "ashuwillticook",
        "name": "Ashuwillticook Rail Trail",
        "description": "The Ashuwillticook Rail Trail is a rail trail built on a former railroad corridor that runs parallel to Route 8 through the towns of Cheshire, Lanesborough and Adams, and into the city of Pittsfield, Massachusetts. It is a multi-use trail for biking, walking, roller-blading, and jogging."
    },
    {
        "id": "bay_colony",
        "name": "Bay Colony Rail Trail",
        "description": "The Bay Colony Rail Trail (BCRT) is a proposed 7-mile multi-use trail through the towns of Needham (open), Dover (in progress) and Medfield (open).  We also partner with Newton's Upper Fall Greenway trail (open). The goal of the BCRT project is to construct a multi-use trail along the unused section of railroad right-of-way owned by the MBTA."
    },
    {
        "id": "belmont",
        "name": "Belmont Community Path",
        "description": "The Belmont Community Path is a planned 2-mile segment of the Massachusetts Central Rail Trail through Belmont. The path will be constructed in two phases, both of which are in th design process. Phase 1 of the Belmont Community Path will connect from the Fitchburg Cutoff Path to the Clark Street Pedestrian Bridge. Phase 2 of the Belmont Community Path will connect from the Clark Street Pedestrian Bridge to the Waltham city line with a linear trail and park. The Boston Metropolitan Planning Organization has allocated funding in its draft 2026 budget to fully construct Phase 1."
    },
    {
        "id": "bfrt",
        "name": "Bruce Freeman Rail Trail",
        "description": "The Bruce Freeman Rail Trail is a rail trail through the communities of Lowell, Chelmsford, Westford, Carlisle, Acton, Concord, Sudbury (under constrction), and Framingham (planned) in Massachusetts — following the 25-mile route of the old New Haven Railroad Framingham & Lowell line. The trail has a 10-foot wide pavement with a 2-foot wide packed shoulder on each side.The Bruce Freeman Rail Trail is open to non-motorized uses such as cycling, jogging, walking, rollerblading, and skiing."
    },
    {
        "id": "billerica",
        "name": "Yankee Doodle Bike Path",
        "description": null
    },
    {
        "id": "bourne",
        "name": "Bourne Rail Trail",
        "description": "The proposed Bourne Rail Trail\/Shining Sea Bikeway Extension project will create a 6.5-mile multi-use path in Bourne connecting the Cape Cod Canal Recreation Path with the Shining Sea Bikeway. Completing the project would create approximately 24 miles of uninterrupted trail on the Upper Cape running from Sandwich to Woods Hole. The proposed Bourne Rail Trail\/Shining Sea Bikeway Extension would be developed on land that is owned by the Massachusetts Department of Transportation. The land, known as the Falmouth Secondary Line, has historically been used as a railroad corridor. The Bourne Rail Trail\/Shining Sea Bikeway Extension would make this publicly owned land available for use by the public and connect two existing recreation paths."
    },
    {
        "id": "canalside",
        "name": "Canalside Rail Trail",
        "description": "The Canalside Rail Trail is a 3.8-mile (6.1 km) trail, partially on old railroad beds, from East Deerfield to Turners Falls in Montague, Massachusetts, USA. A short portion of the trail runs along town streets, but the majority is on a paved trail from which motor vehicles are prohibited. The northern terminus is Unity Park, on Barton's Cove in Turners Falls. The southernmost portion crosses the Connecticut River on the Canalside Rail Trail Bridge and ends at McClelland Farm Road in Deerfield. The trail was completed in spring 2008."
    },
    {
        "id": "ccc_bikeway",
        "name": "Cape Cod Canal Bikeway",
        "description": "The paved Cape Cod Canal Bikeway runs on both sides of the canal. There are 7 miles of path on the north side and 6.5 miles on the south side."
    },
    {
        "id": "ccrt",
        "name": "Cape Cod Rail Trail",
        "description": "The Cape Cod Rail Trail (CCRT) is a paved bikeway that runs 25 miles from South Dennis to Wellfleet. The terrain is relatively flat with some minor grades in certain sections in the Lower \/ Outer Cape areas, specifically Orleans and Wellfleet."
    },
    {
        "id": "charles",
        "name": "Charles River Bike Path",
        "description": "The path follows both shores of the Charles River from Boston, Massachusetts to Norumbega Park in Newton, passing through Watertown and Waltham. The path consists of several segments in the Charles River Reservation separated by road and bridge crossings and forms part of the planned East Coast Greenway."
    },
    {
        "id": "chelsea",
        "name": "Chelsea Greenway",
        "description": "The Chelsea Greenway is a 0.7-mile (1.1 km) rail trail parallel to a Silver Line busway that follows the former Grand Junction Branch right-of-way. Located within the Box District neighborhood, the path connects Bellingham Square station and Eastern Avenue station. The Greenway opened in 2018 along with the busway."
    },
    {
        "id": "clipper_city",
        "name": "Clipper City Rail Trail",
        "description": "The Clipper City Rail Trail (3.3 miles, paved) connects the MBTA commuter rail station to the Harborwalk along the waterfront. A newer section follows the bank of the Merrimack River to Water Street and connects through the South End under High Street to Parker Street in Newbury. It showcases sculptures, a gallery of local paintings, and views over the Merrimack River estuary with great birdwatching. The Clipper City Rail Trail connects to the southern end of Salisbury's Eastern Marsh Trail via the Route 1 Gillis Bridge."
    },
    {
        "id": "cochituate",
        "name": "Cochituate Rail Trail",
        "description": "The Cochituate Rail Trail (CRT) is a multi-use trail that will run from the Village of Saxonville in Framingham to Natick Center, a distance of 4 miles. The Framingham and Natick sections were completed in 2015 and 2022, respectively."
    },
    {
        "id": "connecticut_river",
        "name": "Connecticut River Walk and Bikeway",
        "description": null
    },
    {
        "id": "derry",
        "name": null,
        "description": null
    },
    {
        "id": "ebg",
        "name": "East Boston Greenway",
        "description": "Currently two miles long, the greenway follows the path of a former Conrail line from the East Boston Piers through residential neighborhoods and into the Bremen Street Community Park, which opened in 2007. The Greenway Extension, which was completed in 2016, follows the Blue Line tracks northwards past Logan Airport and Wood Island Marsh before terminating at Constitution Beach."
    },
    {
        "id": "emerald_necklace",
        "name": "Emerald Necklace Trail",
        "description": null
    },
    {
        "id": "fenway",
        "name": "Fenway Multiuse Path",
        "description": "The Fenway Multiuse Path will be an urban trail along a former CSX rail ROW that is currently owned by the MBTA and MassDOT. The trail will start at the Muddy River path in Brookline and extend to Maitland Street at Lansdowne Commuter Rail Station."
    },
    {
        "id": "fitchburg_cutoff",
        "name": "Fitchburg Cutoff Path",
        "description": "The 0.8-mile (1.3 km) segment west of Alewife station through the Alewife Brook Reservation was used as an unpaved trail; a stone dust surface was added in the 1990s. Construction of the paved Fitchburg Cutoff Path took place from September 2010 to August 2013, with a new bridge built over a stormwater management wetland at Alewife. The planned Belmont Community Path will extend west through Belmont parallel to the Fitchburg Line, connecting with existing sections of the Mass Central Rail Trail."
    },
    {
        "id": "georgetown",
        "name": "Georgetown Rail Trail",
        "description": null
    },
    {
        "id": "haggets_pond",
        "name": "Haggett's Pond Rail Trail",
        "description": null
    },
    {
        "id": "hanover",
        "name": "Hanover Branch Rail Trail",
        "description": null
    },
    {
        "id": "hopkinton_central",
        "name": "Center Trail",
        "description": null
    },
    {
        "id": "independence_greenway",
        "name": "Independence Greenway",
        "description": null
    },
    {
        "id": "jamaicaway",
        "name": "Jamaicaway Bike Path",
        "description": null
    },
    {
        "id": "londonderry",
        "name": "Londonderry Rail Trail",
        "description": null
    },
    {
        "id": "manahan",
        "name": "Manahan Rail Trail",
        "description": "The Manhan Rail Trail is a rails-to-trails paved recreational trail and non-motorized commuter route located in the lower Connecticut River Valley of Massachusetts in the town of Easthampton."
    },
    {
        "id": "mansfield_wwii",
        "name": null,
        "description": null
    },
    {
        "id": "marblehead",
        "name": "Marblehead Rail Trail",
        "description": null
    },
    {
        "id": "mclaren",
        "name": "Jay McLaren Memorial Rail Trail",
        "description": null
    },
    {
        "id": "mcrt",
        "name": "Mass Central Rail Trail",
        "description": "The Mass Central Rail Trail is a partially-completed rail trail from Northampton, Massachusetts to Boston along the former right of way of the Massachusetts Central Railroad. When complete, it will run 104 miles (167 km) through Central Massachusetts and Greater Boston. Many segments of the trail, including the Norwottuck Branch Rail Trail and the Somerville Community Path, have been developed as separate projects but will serve as part of the complete Mass Central Rail Trail."
    },
    {
        "id": "methuen",
        "name": "Methuen Rail Trail",
        "description": null
    },
    {
        "id": "minuteman",
        "name": "Minuteman Bikeway",
        "description": null
    },
    {
        "id": "muddy_river",
        "name": "Muddy River Path",
        "description": null
    },
    {
        "id": "nantucket_airport",
        "name": null,
        "description": null
    },
    {
        "id": "nantucket_bartlett",
        "name": null,
        "description": null
    },
    {
        "id": "nantucket_boulevard",
        "name": null,
        "description": null
    },
    {
        "id": "nantucket_cisco",
        "name": null,
        "description": null
    },
    {
        "id": "nantucket_cliff",
        "name": null,
        "description": null
    },
    {
        "id": "nantucket_connector",
        "name": null,
        "description": null
    },
    {
        "id": "nantucket_eel_point",
        "name": null,
        "description": null
    },
    {
        "id": "nantucket_fairgrounds",
        "name": null,
        "description": null
    },
    {
        "id": "nantucket_goose_pond",
        "name": null,
        "description": null
    },
    {
        "id": "nantucket_madeket",
        "name": null,
        "description": null
    },
    {
        "id": "nantucket_milestone",
        "name": null,
        "description": null
    },
    {
        "id": "nantucket_nobadeer",
        "name": null,
        "description": null
    },
    {
        "id": "nantucket_old_south",
        "name": null,
        "description": null
    },
    {
        "id": "nantucket_polpis",
        "name": null,
        "description": null
    },
    {
        "id": "nantucket_prospect",
        "name": null,
        "description": null
    },
    {
        "id": "nantucket_south_shore",
        "name": null,
        "description": null
    },
    {
        "id": "nantucket_surfside",
        "name": null,
        "description": null
    },
    {
        "id": "narrow_guage",
        "name": "Narrow Gauge Rail Trail",
        "description": null
    },
    {
        "id": "nashua",
        "name": "Nashua River Rail Trail",
        "description": null
    },
    {
        "id": "neponset",
        "name": "Neponset River Greenway",
        "description": null
    },
    {
        "id": "newton_upper_falls",
        "name": "Upper Falls Greenway",
        "description": null
    },
    {
        "id": "northern_strand",
        "name": "Northern Strand Community Trail",
        "description": "The Northern Strand Community Trail, also known as the Bike to the Sea Trail, is a 10-mile public-use path project, including a rail trail portion, which connects the cities of Everett, Malden, Revere, Saugus, and Lynn, along the former Saugus Branch Railroad of the Boston & Maine Railroad and other shared-use roads."
    },
    {
        "id": "norwottuck",
        "name": "Norwottuck Branch Rail Trail",
        "description": "The Norwottuck Branch Rail Trail is an 11-mile (18 km) combination bicycle\/pedestrian paved rail trail running from Northampton, Massachusetts, through Hadley and Amherst, to Belchertown, Massachusetts. It opened in 1992, and is now part of the longer Mass Central Rail Trail."
    },
    {
        "id": "old_colony",
        "name": "Old Colony Rail Trail",
        "description": null
    },
    {
        "id": "old_eastern_marsh",
        "name": "Old Eastern Marsh Trail",
        "description": null
    },
    {
        "id": "peabody",
        "name": "Peabody Rail Trail",
        "description": null
    },
    {
        "id": "peabody_danvers_topsfield",
        "name": "Peabody-Danvers-Topsfield Rail Trail",
        "description": null
    },
    {
        "id": "phoenix",
        "name": "Phoenix Bike Trail",
        "description": null
    },
    {
        "id": "plymouth",
        "name": "North Plymouth Rail Trail",
        "description": null
    },
    {
        "id": "quequechan",
        "name": "Quequechan River Rail Trail",
        "description": null
    },
    {
        "id": "reformatory",
        "name": "Reformatory Branch Trail",
        "description": null
    },
    {
        "id": "riverdale",
        "name": "Riverdale Parkway Bike Path",
        "description": null
    },
    {
        "id": "salem",
        "name": "Salem Rail Trail",
        "description": null
    },
    {
        "id": "salisbury_ghost",
        "name": "Salisbury Point Ghost Trail",
        "description": null
    },
    {
        "id": "shining_sea",
        "name": "Shining Sea Bikeway",
        "description": null
    },
    {
        "id": "sntt",
        "name": "Southern New England Trunkline Trail",
        "description": null
    },
    {
        "id": "sommerville",
        "name": "Sommerville Community Path",
        "description": "The Somerville Community Path is a paved rail trail in Somerville, Massachusetts, running 1.3 miles (2.1 km) from Massachusetts Avenue to Lowell Street via Davis Square. Opened in segments between 1985 and 2015, it follows part of the former Fitchburg Cutoff rail line. A 1.9-mile (3.1 km) extension to East Cambridge will open in 2023 as part of the Green Line Extension project."
    },
    {
        "id": "standish_frost",
        "name": "Frost Pocket Path",
        "description": null
    },
    {
        "id": "swampscott",
        "name": "Swampscott Rail Trail",
        "description": null
    },
    {
        "id": "swc",
        "name": "Southwest Cooridor",
        "description": "The Southwest Corridor Park is a 4.1 mile, linear park stretching from the Back Bay to Forest Hills. The park links South End, Back Bay, Roxbury and Jamaica Plain with a street-level, greenway. Recreational facilities include: 11 playgrounds, 2 spray pools, 7 basketball courts, 5 tennis courts, 2 street hockey rinks, 2 amphitheaters, and 6 miles of trails."
    },
    {
        "id": "twin_cities",
        "name": "Twin Cities Rail Trail",
        "description": null
    },
    {
        "id": "upper_charles",
        "name": "Upper Charles Rail Trail",
        "description": null
    },
    {
        "id": "waltham_wayside",
        "name": "Waltham Wayside Trail",
        "description": null
    },
    {
        "id": "watertown_cambridge",
        "name": "Watertown-Cambridge Greenway",
        "description": null
    },
    {
        "id": "wenham_canal",
        "name": "Wenham Canal Trail",
        "description": null
    },
    {
        "id": "west_springfield_river",
        "name": "Connecticut River Walk and Bikeway",
        "description": null
    }
]